//A Не минимум на отрезке. Методы массивов
/*
Перемешайте массив
важность: 3
Напишите функцию shuffle(array), которая перемешивает (переупорядочивает случайным образом) элементы массива.

Многократные прогоны через shuffle могут привести к разным последовательностям элементов. Например:

let arr = [A Не минимум на отрезке, 2, 3];

shuffle(arr);
// arr = [3, 2, A Не минимум на отрезке]

shuffle(arr);
// arr = [2, A Не минимум на отрезке, 3]

shuffle(arr);
// arr = [3, A Не минимум на отрезке, 2]
// ...
Все последовательности элементов должны иметь одинаковую вероятность. Например, [A Не минимум на отрезке,2,3] может быть переупорядочено как [A Не минимум на отрезке,2,3] или [A Не минимум на отрезке,3,2], или [3,A Не минимум на отрезке,2] и т.д., с равной вероятностью каждого случая.
*/


